In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({"Brand":["Maruti","Hyundai","Tata","Tata","Mahindra","Maruti","Hyundai","Renault","Tata"],
                     "Year":[2012,2014,2011,2015,2012,2016,2014,2018,2019],
                     "Kms Driven":[50000,30000,60000,25000,10000,46000,31000,15000,12000],
                     "City":["Gurgaon","Delhi","Mumbai","Delhi","Mumbai","Delhi","Mumbai","Chennai","Ghaziabad"],
                     "Mileage":[28,27,25,26,28,29,24,21,24]
                    })

In [3]:
display(data.loc[(data.Brand == 'Maruti') & (data.Mileage > 20)])

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
5  Maruti  2016       46000    Delhi       29

In [4]:
data.loc[2:5,['Brand','Mileage']]

      Brand  Mileage
2      Tata       25
3      Tata       26
4  Mahindra       28
5    Maruti       29

In [5]:
print(data.loc[2:5,['Brand','Mileage']])

      Brand  Mileage
2      Tata       25
3      Tata       26
4  Mahindra       28
5    Maruti       29

In [6]:
data.loc[data['Mileage'] > 22]

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3      Tata  2015       25000      Delhi       26
4  Mahindra  2012       10000     Mumbai       28
5    Maruti  2016       46000      Delhi       29
6   Hyundai  2014       31000     Mumbai       24
8      Tata  2019       12000  Ghaziabad       24

In [7]:
data.loc[(data.Year < 2015),['Mileage']]=22
data

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       22
1   Hyundai  2014       30000      Delhi       22
2      Tata  2011       60000     Mumbai       22
3      Tata  2015       25000      Delhi       26
4  Mahindra  2012       10000     Mumbai       22
5    Maruti  2016       46000      Delhi       29
6   Hyundai  2014       31000     Mumbai       22
7   Renault  2018       15000    Chennai       21
8      Tata  2019       12000  Ghaziabad       24

In [8]:
data.iloc[[0,2,4,7]]

      Brand  Year  Kms Driven     City  Mileage
0    Maruti  2012       50000  Gurgaon       22
2      Tata  2011       60000   Mumbai       22
4  Mahindra  2012       10000   Mumbai       22
7   Renault  2018       15000  Chennai       21

In [9]:
data.iloc[1:5,2:5]

   Kms Driven    City  Mileage
1       30000   Delhi       22
2       60000  Mumbai       22
3       25000   Delhi       26
4       10000  Mumbai       22

In [10]:
df={
    'Name':['Alice','Bob','Charlie','David'],
    'Age':[25,30,35,40],
    'Salary':[50000,60000,70000,80000]
   
}
df = pd.DataFrame(df, index=['A','B','C','D'])
df

      Name  Age  Salary
A    Alice   25   50000
B      Bob   30   60000
C  Charlie   35   70000
D    David   40   80000

In [11]:
df.loc['B']

Name        Bob
Age          30
Salary    60000
Name: B, dtype: object

In [12]:
df.loc['C','Salary']

70000

In [13]:
df.loc[df['Name']=='Charlie',["Salary"]]

   Salary
C   70000

In [14]:
df.iloc[:2,:2]

    Name  Age
A  Alice   25
B    Bob   30

In [15]:
df.iloc[-1,-1]

80000

In [16]:
df

      Name  Age  Salary
A    Alice   25   50000
B      Bob   30   60000
C  Charlie   35   70000
D    David   40   80000

In [17]:
df.loc[df["Age"] > 25,['Name','Salary']]

      Name  Salary
B      Bob   60000
C  Charlie   70000
D    David   80000

In [18]:
df.loc[(df.Salary > 60000),['Name','Salary']]

      Name  Salary
C  Charlie   70000
D    David   80000

In [19]:
df.loc[(df.Name ==  "David"),['Salary']] = 90000
df

      Name  Age  Salary
A    Alice   25   50000
B      Bob   30   60000
C  Charlie   35   70000
D    David   40   90000

In [20]:
df.loc[df["Name"] ==  "David",['Salary']] = 90000
df

      Name  Age  Salary
A    Alice   25   50000
B      Bob   30   60000
C  Charlie   35   70000
D    David   40   90000

In [21]:
df.iloc[1,1] = 28
df

      Name  Age  Salary
A    Alice   25   50000
B      Bob   28   60000
C  Charlie   35   70000
D    David   40   90000

In [32]:
df.loc["B":"D"]

      Name  Age  Salary
B      Bob   28   60000
C  Charlie   35   70000
D    David   40   90000

In [23]:
df.loc[:,["Age","Salary"]]

   Age  Salary
A   25   50000
B   28   60000
C   35   70000
D   40   90000

In [24]:
df.iloc[:3]

      Name  Age  Salary
A    Alice   25   50000
B      Bob   28   60000
C  Charlie   35   70000